[
  {
    "Axis Bank credit_cards": [
      {
        "rewards": "Complimentary Sony LIV Premium subscription for 1 Year worth ₹ 1499, Flat ₹ 120 off on Swiggy; twice a month, Enjoy complimentary airport lounge access (4 times per year)",
        "card_name": "My Zone Credit Card",
        "annual_fee": "₹ 500",
        "interest_rate": ""
      },
      {
        "rewards": "Monthly 2 times – Up to ₹ 120 off at Zomato, 5% off on Utility Bill Payment on PayTM, 10% off on BookMyShow and BlinkIt",
        "card_name": "NEO Credit Card",
        "annual_fee": "₹ 0 (Limited Period Offer)",
        "interest_rate": ""
      },
      {
        "rewards": "5% cashback on bill payments & recharges on Google Pay, 4% cashback on Swiggy, Zomato & Ola, 1.5% cashback on other spends, 4 Complimentary lounge access at select domestic airports, 1% fuel surcharge waiver",
        "card_name": "Axis Bank ACE Credit Card",
        "annual_fee": "₹ 0 (Limited Period Offer)",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome benefits worth ₹ 600, Unlimited cashbacks from Flipkart and many more, Enjoy our airport lounge access (4 times per year)",
        "card_name": "Flipkart Axis Bank Credit Card",
        "annual_fee": "₹ 500",
        "interest_rate": ""
      },
      {
        "rewards": "Amazon eVoucher worth ₹ 500 on first card transaction, 25% cashback on Airtel Mobile, Broadband, WiFi and DTH bill payments, 4 Complimentary lounge visits at select domestic airports, 1% fuel surcharge waiver",
        "card_name": "Airtel Axis Bank Credit Card",
        "annual_fee": "₹ 500",
        "interest_rate": ""
      },
      {
        "rewards": "12,500 EDGE RPs redeemable against vouchers worth Rs.2500, Get additional 10,000 Edge Reward Points on Spends of Rs 2.5 lakh",
        "card_name": "Axis Bank Privilege Credit Card",
        "annual_fee": "₹ 1500",
        "interest_rate": ""
      },
      {
        "rewards": "Now seamlessly Pay with UPI using your credit card, Up to 1250 EDGE Rewards on 1st fuel transaction, 4% value back on fuel spends at Indian Oil outlets",
        "card_name": "IndianOil Axis Bank Credit Card",
        "annual_fee": "₹ 500",
        "interest_rate": ""
      },
      {
        "rewards": "Milestone benefit of 1,500 EDGE reward points, Bouquet of membership up to Rs. 1,000 every anniversary year",
        "card_name": "Rewards Credit Card",
        "annual_fee": "₹ 1000",
        "interest_rate": ""
      },
      {
        "rewards": "Choose any one voucher worth INR 12,500 from below options, 5X eDGE Reward points on spends via Travel eDGE, Unlimited lounge accesses",
        "card_name": "Axis Bank Magnus Credit Card",
        "annual_fee": "₹ 12,500",
        "interest_rate": ""
      },
      {
        "rewards": "10,000 EDGE REWARD Points worth Rs. 2,000, Flat Rs. 200 off on Swiggy, Flat Rs 500 off on Big Basket",
        "card_name": "Axis Bank Select Credit Card",
        "annual_fee": "₹ 3000",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome benefits of 2,500 Miles, Accrue 5X miles per Rs 100 spent on travel, Converting EDGE Miles to program partner Miles (1 EDGE Mile = 2 Partner Mile)",
        "card_name": "Axis Bank Atlas Credit Card",
        "annual_fee": "₹ 5000",
        "interest_rate": ""
      },
      {
        "rewards": "Get welcome decathlon OMNI Gift Card worth INR 750, Earn 2 points per spend of INR 200 and 5x reward points on Insurance, Get 48 online video doctor consultations free per year, Get 48 interactive fitness video training sessions free per year, Get discount upto INR 500 on health checkup",
        "card_name": "Axis Bank AURA Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Earn 6X Miles on fuel spends and 2X miles on grocery spends, Unlimited fuel surcharge waiver at all IOCL outlets, 30% on Zomato spends, valid 2X per month",
        "card_name": "IndianOil Axis Bank Premium Credit Card",
        "annual_fee": "₹ 1000",
        "interest_rate": ""
      },
      {
        "rewards": "Personalised card with shades of Tricolour for defence Personnel, 4 points with every Rs. 200 spent, 1200 eDGE Loyalty Reward points every year, Fuel Surcharge waiver",
        "card_name": "Axis Bank Pride Platinum Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Personalised card with shades of Tricolour for defence Personnel, 4 points with every Rs. 200 spent, 15% discount at restaurants with Dining delights",
        "card_name": "Axis Bank Pride Signature Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Contactless enabled secured credit card, 4 points with every Rs. 200 spent, 25% cashback on movies.",
        "card_name": "Axis Bank MY Zone Easy Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Various Shopping & travel benefits, 10 points on Domestic/ International spends for every Rs.200 spent, Shopping or Travel Vouchers worth Rs.5000 on Activation",
        "card_name": "Privilege Easy Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Satya Paul Gift Vouchers, 15% discount on dining, 10/20 points for every Rs. 200 spent on Domestic/International spends, 50% cashback on movie tickets, Up to 15% discounts on dining",
        "card_name": "Axis Bank Signature Credit Card with Lifestyle Benefits",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "A perfect card for movie lovers. Enjoy 25% cashback on movie tickets, 6 points on every Rs.200 spent on credit card domestically",
        "card_name": "Platinum Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "A card packed with exciting Travel Benefits to make your journey even more rewarding, 8 points with every Rs. 200 spent while travelling abroad, Fuel Surcharge waiver.",
        "card_name": "Titanium Smart Traveler Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Avail two base fare flight tickets complimentary, 4 points on every Rs. 200 spent on credit card, Upto 20% cashback on base fare domestic flight bookings",
        "card_name": "Axis Bank My Wings Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "500 Supercoins on card activation, 12% Supercoins for Flipkart Plus customers and 6% Supercoins for Flipkart Non-Plus customers on Flipkart capped upto transaction value of Rs 2500, 2% Supercoins on all other spends uncapped, Annual fee waiver on spends greater than 2 Lakh",
        "card_name": "Flipkart Axis Bank Super Elite Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Earn EDGE Miles: Welcome Benefit & Renewal Benefit, 5 EDGE Miles on every INR 100 spent on Axis Bank Travel EDGE portal and Airline website, Enjoy complimentary International & Domestic lounge access",
        "card_name": "HORIZON Credit Card",
        "annual_fee": "₹ 3000",
        "interest_rate": ""
      },
      {
        "rewards": "Rs. 4,000 worth SpiceJet flight voucher, Complimentary SpiceClub Gold Membership, Unlimited SpiceClub Point earn & bonus earn on Milestone & Renewal",
        "card_name": "SpiceJet Axis Bank Voyage Black Credit Card",
        "annual_fee": "₹ 2000",
        "interest_rate": ""
      },
      {
        "rewards": "Complimentary Airport Concierge Services, 15000 EDGE points on card activation, ITC Culinaire, Accor Plus and Club Marriott hotel memberships; 50 golf rounds per year",
        "card_name": "Axis Bank Reserve Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "30000 EDGE REWARD Points on doing upon 3 transactions within 30 days from card issuance date, 10% Cashback on SAMSUNG purchases, across products & services.",
        "card_name": "Samsung Axis Bank Infinite Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Up to 3% cashback on every transaction, CC on UPI enabled credit card for seamless transactions, Complimentary domestic Lounge Access basis spends",
        "card_name": "Fibe Axis Bank Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome Benefits worth of Rs. 2550, Earn up to 20 FC Points at Shoppers Stop, Earn up 2 FC Points on other spends",
        "card_name": "Axis Bank Shoppers Stop Credit Card",
        "annual_fee": "₹ 500",
        "interest_rate": ""
      },
      {
        "rewards": "Rs. 1500 worth SpiceJet Flight vouchers on doing 2 transactions in first 30 days, upto 18 SC Points on credit card spends, Complimentary 1 year SpiceClub Silver membership upto 6000 Bonus SpiceClub Points as milestone upto 4 complimentary domestic airport lounge access in a year",
        "card_name": "SpiceJet Axis Bank Voyage Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Amazon eVoucher worth Rs.500 on first card transaction, 25% cashback on Airtel Mobile, Broadband, WiFi and DTH bill payments, 10% cashback on bigbasket, Zomato and Swiggy, 4 Complimentary lounge visits at select domestic airports, 1% fuel surcharge waiver",
        "card_name": "Airtel Axis Bank Credit Card",
        "annual_fee": "₹ 500",
        "interest_rate": ""
      },
      {
        "rewards": "2500 EDGE REWARD Points on completing 3 transactions within 30 days from card issuance date, 10% Cashback on SAMSUNG purchases all year around, across products & services.",
        "card_name": "Samsung Axis Bank Signature Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Earn EDGE Miles: Welcome Benefit & Renewal Benefit, 5 EDGE Miles on every INR 100 spent on Axis Bank Travel EDGE portal and Airline website, Enjoy complimentary International & Domestic lounge access",
        "card_name": "Miles and More Axis Bank Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Now get a virtual card instantly on your Freecharge Application, 1 Point for every Rs. 200 Spent, Bonus eDGE Rewards on crossing monthly thresholds of Rs.2000 and Rs.5000",
        "card_name": "Axis Bank Freecharge Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "5% on Freecharge Spends, 2% on Ola/Uber/Shuttle and other local transport, 1% on all other spends, Annual Fee waiver on spends of Rs.50,000 in an anniversary year",
        "card_name": "Axis Bank Freecharge Plus Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Earn 2X Rewards on LIC Premium payments and foreign currency transactions, Earn 1X Rewards on every spend except Fuel, Wallet and EMI, Upto 8 complimentary domestic airport lounge access per year, 1% fuel surcharge waiver",
        "card_name": "LIC Axis Bank Signature Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "2X benefits on LIC Premium payments and foreign currency transactions, Earn 1X Rewards on every spend except Fuel, Wallet and EMI, 1% fuel surcharge waiver",
        "card_name": "LIC Axis Bank Platinum Credit Card",
        "annual_fee": "₹ 0",
        "interest_rate": ""
      },
      {
        "rewards": "Get cashback of up to 7% on all eligible online spends, Get 0.75% cashback on retail spends or spends on travel (both online and offline), Get 0.5% cashback on utility spends",
        "card_name": "Cashback Credit Card",
        "annual_fee": "₹ 1000",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome Benefit – 1 Complimentary Economy Class Ticket on joining fee payment, Earn Upto 3 economy class tickets every year, Earn 2 CV points per 200 spent",
        "card_name": "Axis Bank Vistara Credit Card",
        "annual_fee": "₹ 1500",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome Benefit – 1 Complimentary Premium Economy Class Ticket on joining fee payment, Earn Upto 4 Premium economy class tickets every year, Earn 4 CV points per 200 spent",
        "card_name": "Axis Bank Vistara Signature Credit Card",
        "annual_fee": "₹ 3000",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome Benefit – 1 Complimentary Business Class Ticket on joining fee payment, Earn Upto 4 Business class tickets every year, Earn 6 CV points per 200 spent",
        "card_name": "Axis Bank Vistara Infinite Credit Card",
        "annual_fee": "₹ 10000",
        "interest_rate": ""
      }
    ]
  }
]