[
  {
    "HDFC Bank credit_cards": [
      {
        "rewards": "5% CashBack on choice of any 2 Packs - Dining & Entertainment Category – BookMyShow & Zomato, Travel Category – MakeMyTrip & Uber, Grocery Category – Blinkit & Reliance Smart Bazaar, Electronics Category – Croma & Reliance Digital, Fashion Category – Nykaa & Myntra; 3% CashBack on choice of any one e-commerce merchant - Amazon or Flipkart or PayZapp; 1% Unlimited CashBack on all spends; 1% Cashback on UPI Spends (Applicable only on PIXEL RuPay Credit Card holders); Customize your card reflecting your lifestyle by choosing a card design and a billing cycle that suits you; Apply & Control your PIXEL Credit Card on PayZapp.",
        "card_name": "PIXEL Play Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Avail up to 50 days of Interest free credit period; 10X CashPoints on - Big Basket, BookMyshow, OYO, Swiggy & Uber; 1 CashPoint per ₹150 spent on other spends.",
        "card_name": "Freedom Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Earn up to 50 Liters of Free fuel annually; Earn 5% of your spends as Fuel Points at IndianOil outlets, Groceries and Bill Payments; Earn 1 Fuel Point for every Rs. 150 spent on all other purchases; Enjoy 1% Fuel Surcharge waiver.",
        "card_name": "IndianOil HDFC Bank Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "'Buy 1 Get 1 Free' on all tickets via BookMyShow; 5X Reward Points on Swiggy and Zomato; Complimentary Annual Memberships of Swiggy One and Times Prime as Welcome Benefit; ₹ 1,500 worth Marriott, Decathlon & more vouchers on quarterly spends of Rs. 1.5 lakh; 8 Complimentary airport lounge access worldwide; 4 Reward Points for every ₹ 150 spent.",
        "card_name": "Diners Club Privilege Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "5% Cashback on Amazon, BookMyShow, Cult.fit, Flipkart, Myntra, Sony LIV, Swiggy, Tata CLiQ, Uber and Zomato; 1% Cashback on other spends; ₹1000 worth gift vouchers on spends of ₹1,00,000 and above in each calendar quarter.",
        "card_name": "Millennia Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "10X CashPoints (3.3% Valueback) on Amazon, Flipkart, Swiggy, Reliance Smart SuperStore & BigBasket; Avail up to 50 days of interest free credit period; 2 CashPoints per ₹150 spent on other spends; Get ₹500 gift voucher on spends on ₹50,000 per calendar quarter.",
        "card_name": "MoneyBack+ Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "2% back as NeuCoins on Tata Neu and partner Tata Brand Spends; Additional 5% back as NeuCoins on Tata Neu Spends, post registering for Tata NeuPass; 1% back as NeuCoins on other spends; 4 Complimentary Domestic Airport Lounge Access.",
        "card_name": "Tata Neu Plus HDFC Bank Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "5% Cashback on online spends across top brands; 1% Cashback on other categories; Complimentary Swiggy One Membership for 3 months on card activation; 10% Cashback on Swiggy application (Food ordering, Instamart, Dineout & Genie).",
        "card_name": "Swiggy HDFC Bank Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Complimentary Club Vistara Silver Tier and MMT Black Elite membership as Welcome benefits; ₹ 1,500 worth vouchers on quarterly spends of Rs. 1.5 lakh; ₹ 5,000 worth flight vouchers on annual spends of Rs. 5 lakh and Rs. 7.5 lakhs; 5X Reward Points on spends at Marks & Spencer, Myntra, Nykaa & Reliance Digital.",
        "card_name": "Regalia Gold Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Complimentary Club Marriott membership for first year; Complimentary nights & weekend buffet at participating ITC hotels; Unlimited Complimentary golf games at leading courses across India and select courses across the world; 5 Reward Points for every ₹ 150 spent.",
        "card_name": "INFINIA Metal Edition",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Metal Card; Unlimited Airport Lounge Access; 6 Complimentary Golf games every quarter across the finest courses in the world; Complimentary Annual memberships of Club Marriott, Amazon Prime, Swiggy One as Welcome Benefit; 10,000 Bonus Reward Points on spends of ₹ 4 lakh every calendar quarter.",
        "card_name": "Diners Club Black Metal Edition Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Upto 3% Unlimited Cashback everytime; Paytm First Membership - Upto 75k worth benefits; Earn upto Rs. 1200 Cashback annually; Upto 50 days of credit free period.",
        "card_name": "Paytm HDFC Bank Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Upto 5% Unlimited Cashback everytime; Paytm First Membership - Upto 75k worth benefits; 8 Complimentary Airport Lounge Access; Gift Vouchers worth Rs.500 every Calendar Quarter.",
        "card_name": "Paytm HDFC Bank Select Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Upto 2% Unlimited Cashback everytime; Upgrade to Paytm HDFC Bank Credit Card in 3 months; Customize your card the way you like; Instant issuance/ virtual credit card.",
        "card_name": "Paytm HDFC Bank Mobile Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "3% Cashpoints on Groceries, SuperMarket & Dining spends & all PayZapp transactions; 2% Cashpoints on Utility spends; 1% Cashpoints on other spends.",
        "card_name": "HDFC Bank UPI RuPay Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Upto 2% Accelerated Cashback on Scan & Pay; Upto 2% Cashback on Swiggy & Uber spends; Customize your card the way you like; Instant issuance/ virtual credit card.",
        "card_name": "Paytm HDFC Bank Digital Credit Card",
        "annual_fee": "",
        "interest_rate": ""
      }
    ]
  }
]