[
  {
    "SBI Bank credit_cards": [
      {
        "rewards": "Get 5,000 Travel Credits as Welcome Gift, Earn 6 Travel Credits for every Rs. 200 spent on travel, Earn 20,000 Bonus Travel Credits on annual spends of Rs. 12 Lakh, Convert your Travel Credits into Air Miles/Hotel Points, Travel Bookings or choose from a wide array of Catalogue Products.",
        "card_name": "SBI Card Miles Elite",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Noise ColorFit Pulse 4 Pro Smartwatch worth Rs. 7,999 on payment of joining fees, 12 Month Membership for FITPASS PRO and Netmeds First on payment of joining fee and card activation, 5X Reward Points on Chemist, Pharmacy, Sports, Dining and Movie Spends, E-Voucher worth Rs.1,500 on achieving Retail spends of Rs. 4 Lakh in one annual year.",
        "card_name": "SBI Card PULSE",
        "annual_fee": "Rs. 1,499 + Taxes",
        "interest_rate": ""
      },
      {
        "rewards": "Get Amazon.in gift card worth Rs. 500 on payment of Annual Fee, 5X Reward Points on online spends, 10X Reward Points on online spends with exclusive partners, E-vouchers worth Rs.2000 on annual online spends of Rs.1 Lakh and Rs.2 Lakhs each.",
        "card_name": "SimplyCLICK SBI Card",
        "annual_fee": "Rs. 499 + taxes",
        "interest_rate": ""
      },
      {
        "rewards": "5% cashback on online spends, 1% cashback on offline spends, Card Cashback will be auto-credited to your SBI Card account within two days of your next statement generation.",
        "card_name": "CASHBACK SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome e-Gift Voucher worth Rs. 5,000 on joining, Get free movie tickets worth Rs. 6,000 every year, Earn upto 50,000 Bonus Reward Points worth Rs. 12,500/year.",
        "card_name": "SBI Card ELITE",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "2,000 bonus reward points on spends of Rs. 2,000 in first 60 days, Enjoy 10 Reward Points per Rs.150 spent on Dining, Movies, Departmental Stores and Grocery Spends, Annual fees reversal on spends of Rs. 1,00,000 and above, 1% fuel surcharge waiver across all petrol pumps.",
        "card_name": "SimplySAVE SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome e-Gift Voucher worth Rs. 3,000 on joining, Spend linked Gift Vouchers worth Rs. 11,000, 10 Reward Points per Rs. 100 spent on Dining, Groceries, Departmental stores and Movies, Complimentary International and Domestic Airport Lounge access.",
        "card_name": "SBI Card PRIME",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Earn 7% back on all Ola rides, Earn 1% back on all other Spends, Zero Annual Fee for the first year.",
        "card_name": "OLA Money SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome benefit of 500 Reward Points worth Rs. 500 on payment of joining fee, Complimentary OneApollo Gold Tier Membership, Get Upto 10% Instant Discount at Select Apollo Services, 3X Reward Points on every Rs. 100 spent on all Apollo services.",
        "card_name": "Apollo SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "3000 Krisflyer Miles as Welcome Gift, 5 Krisflyer Miles per Rs 200 spent on Singapore Airlines and International spends, 2 Krisflyer Miles per Rs. 200 spent on all other eligible spends, 4 domestic lounge benefits in a year.",
        "card_name": "KrisFlyer SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "10,000 KrisFlyer Miles as Welcome Gift, 10 KrisFlyer miles per Rs 200 spent on SIA Group, 8 KrisFlyer miles per Rs 200 spent Internationally, 6 KrisFlyer miles per Rs 200 on other eligible spends.",
        "card_name": "KrisFlyer SBI Card Apex",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Get 3,000 Travel Credits as Welcome Gift, Earn 4 Travel Credits for every Rs. 200 spent on travel, Earn 10,000 Bonus Travel Credits on annual spends of Rs. 8 Lakh, Convert your Travel Credits into Air Miles/Hotel Points, Travel Bookings or choose from a wide array of Catalogue Products.",
        "card_name": "SBI Card MILES PRIME",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Get 25X Reward Points on BPCL Fuel, Lubricants & Bharat Gas spends, Get 10X Reward Points on Departmental & Grocery, Movies & Dining Spends, 4 Complimentary Domestic Airport Lounge Access in a year.",
        "card_name": "BPCL SBI Card OCTANE",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "10% back as Reward Points for railway ticket purchases, Welcome benefits worth INR 1500, Milestone benefits worth INR 7500 on annual travel spends, 1% transaction charges waiver on railway ticket bookings on www.irctc.co.in.",
        "card_name": "IRCTC SBI Card Premier",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "5,000 Etihad Guest Miles as Welcome Gift, Complimentary Etihad Guest Gold Tier Status post first transaction, Earn 3X Etihad Guest Miles on all Etihad Spends, Earn Upto 6000 Etihad Guest miles annually on quarterly spend of 1.5 lakh/quarter.",
        "card_name": "Etihad Guest SBI Premier Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "2,500 Etihad Guest Miles as Welcome Gift, Complimentary Etihad Guest Silver Tier Status post first transaction, Earn 3X Etihad Guest Miles on all Etihad Spends, Earn 5,000 Etihad Guest miles on an annual spend of 5 Lakh.",
        "card_name": "Etihad Guest SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome Premium Economy ticket voucher for Vistara domestic network, Club Vistara Silver Tier Membership renewed every year, Up to 4 Premium Economy ticket vouchers & 1 Hotel Voucher worth Rs 10,000 on achieving milestone spends of Rs 8 lakhs.",
        "card_name": "Club Vistara SBI Card PRIME",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome Economy ticket voucher for Vistara's domestic network, Up to 3 Economy ticket vouchers & 1 Hotel Voucher worth Rs 5,000 on achieving milestone spends of Rs 5 lakhs, Up to 4 free flight cancellations on Vistara flight booking.",
        "card_name": "Club Vistara SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      },
      {
        "rewards": "Welcome Gift Vouchers.",
        "card_name": "Yatra SBI Card",
        "annual_fee": "",
        "interest_rate": ""
      }
    ]
  }
]